# Boolean Properties

---
The SpecTypeIdBoolean type exposes the following members.
| Name| Description
---|---|---
| YesNo|  Yes/No, in discipline Common.
Top
#### Reference
SpecTypeIdBoolean Class
Autodesk.Revit.DB Namespace